{
    "typeName": "TF::Alicloud::EssScheduledTask",
    "description": "Provides a ESS schedule resource.",
    "sourceUrl": "https://github.com/iann0036/cfn-tf-custom-types.git",
    "documentationUrl": "https://github.com/iann0036/cfn-tf-custom-types/blob/docs/resources/alicloud/TF-Alicloud-EssScheduledTask/docs/README.md",
    "definitions": {},
    "properties": {
        "tfcfnid": {
            "description": "Internal identifier for tracking resource changes. Do not use.",
            "type": "string"
        },
        "Description": {
            "type": "string",
            "description": "Description of the scheduled task, which is 2-200 characters (English or Chinese) long."
        },
        "DesiredCapacity": {
            "type": "number",
            "description": "The expected number of instances in a scaling group when the scaling method of the scheduled task is to specify the number of instances in a scaling group. **NOTE:** You must specify the `DesiredCapacity` parameter when you create the scaling group."
        },
        "Id": {
            "type": "string"
        },
        "LaunchExpirationTime": {
            "type": "number",
            "description": "The time period during which a failed scheduled task is retried. Unit: seconds. Valid values: 0 to 21600. Default value: 600."
        },
        "LaunchTime": {
            "type": "string",
            "description": "The time at which the scheduled task is triggered. Specify the time in the ISO 8601 standard in the YYYY-MM-DDThh:mmZ format.\nThe time must be in UTC. You cannot enter a time point later than 90 days from the date of scheduled task creation.\nIf the `recurrence_type` parameter is specified, the task is executed repeatedly at the time specified by LaunchTime.\nOtherwise, the task is only executed once at the date and time specified by LaunchTime."
        },
        "MaxValue": {
            "type": "number",
            "description": "The maximum number of instances in a scaling group when the scaling method of the scheduled task is to specify the number of instances in a scaling group."
        },
        "MinValue": {
            "type": "number",
            "description": "The minimum number of instances in a scaling group when the scaling method of the scheduled task is to specify the number of instances in a scaling group."
        },
        "RecurrenceEndTime": {
            "type": "string",
            "description": "Specifies the end time after which the scheduled task is no longer repeated. Specify the time in the ISO 8601 standard in the YYYY-MM-DDThh:mm:ssZ format.\nThe time must be in UTC. You cannot enter a time point later than 365 days from the date of scheduled task creation. **NOTE:** You must specify `RecurrenceType`, `RecurrenceValue`, and `RecurrenceEndTime` at the same time."
        },
        "RecurrenceType": {
            "type": "string",
            "description": "Specifies the recurrence type of the scheduled task. **NOTE:** You must specify `RecurrenceType`, `RecurrenceValue`, and `RecurrenceEndTime` at the same time. Valid values:\n- Daily: The scheduled task is executed once every specified number of days.\n- Weekly: The scheduled task is executed on each specified day of a week.\n- Monthly: The scheduled task is executed on each specified day of a month.\n- Cron: (Available in 1.60.0+) The scheduled task is executed based on the specified cron expression."
        },
        "RecurrenceValue": {
            "type": "string",
            "description": "Specifies how often a scheduled task recurs. **NOTE:** You must specify `RecurrenceType`, `RecurrenceValue`, and `RecurrenceEndTime` at the same time. The valid value depends on `recurrence_type`\n- Daily: You can enter one value. Valid values: 1 to 31.\n- Weekly: You can enter multiple values and separate them with commas (,). For example, the values 0 to 6 correspond to the days of the week in sequence from Sunday to Saturday.\n- Monthly: You can enter two values in A-B format. Valid values of A and B: 1 to 31. The value of B must be greater than or equal to the value of A.\n- Cron: You can enter a cron expression which is written in UTC and consists of five fields: minute, hour, day of month (date), month, and day of week. The expression can contain wildcard characters including commas (,), question marks (?), hyphens (-), asterisks (*), number signs (#), forward slashes (/), and the L and W letters."
        },
        "ScalingGroupId": {
            "type": "string",
            "description": "The ID of the scaling group where the number of instances is modified when the scheduled task is triggered. After the `ScalingGroupId` parameter is specified, the scaling method of the scheduled task is to specify the number of instances in a scaling group. You must specify at least one of the following parameters: `MinValue`, `MaxValue`, and `DesiredCapacity`. **NOTE:** You cannot specify `scheduled_action` and `scaling_group_id` at the same time."
        },
        "ScheduledAction": {
            "type": "string",
            "description": "The operation to be performed when a scheduled task is triggered. Enter the unique identifier of a scaling rule. **NOTE:** You cannot specify `scheduled_action` and `scaling_group_id` at the same time."
        },
        "ScheduledTaskName": {
            "type": "string",
            "description": "Display name of the scheduled task, which must be 2-40 characters (English or Chinese) long."
        },
        "TaskEnabled": {
            "type": "boolean",
            "description": "Specifies whether to start the scheduled task. Default to true."
        }
    },
    "additionalProperties": false,
    "required": [],
    "readOnlyProperties": [
        "/properties/tfcfnid",
        "/properties/Id"
    ],
    "primaryIdentifier": [
        "/properties/tfcfnid"
    ],
    "handlers": {
        "create": {
            "permissions": [
                "s3:GetObject",
                "s3:DeleteObject",
                "lambda:InvokeFunction"
            ]
        },
        "read": {
            "permissions": [
                "s3:GetObject"
            ]
        },
        "update": {
            "permissions": [
                "s3:GetObject",
                "s3:DeleteObject",
                "lambda:InvokeFunction"
            ]
        },
        "delete": {
            "permissions": [
                "s3:GetObject",
                "s3:DeleteObject",
                "lambda:InvokeFunction"
            ]
        },
        "list": {
            "permissions": [
                "s3:GetObject",
                "s3:ListBucket"
            ]
        }
    }
}