{
    "typeName": "TF::AVI::Icapprofile",
    "description": "The IcapProfile resource allows the creation and management of Avi IcapProfile",
    "sourceUrl": "https://github.com/iann0036/cfn-tf-custom-types.git",
    "documentationUrl": "https://github.com/iann0036/cfn-tf-custom-types/blob/docs/resources/avi/TF-AVI-Icapprofile/docs/README.md",
    "definitions": {},
    "properties": {
        "tfcfnid": {
            "description": "Internal identifier for tracking resource changes. Do not use.",
            "type": "string"
        },
        "Allow204": {
            "type": "boolean",
            "description": "Allow icap server to send 204 response as described in rfc 3507 section 4.5. Service engine will buffer the complete request if alllow_204 is enabled. If disabled, preview_size request body will be buffered if enable_preview is set to true, and rest of the request body will be streamed to the icap server. Field introduced in 20.1.3."
        },
        "BufferSize": {
            "type": "number",
            "description": "The maximum buffer size for the http request body. If the request body exceeds this size, the request will not be checked by the icap server. In this case, the configured action will be executed and a significant log entry will be generated. Allowed values are 1-51200. Field introduced in 20.1.1. Unit is kb."
        },
        "BufferSizeExceedAction": {
            "type": "string",
            "description": "Decide what should happen if the request body size exceeds the configured buffer size. If this is set to fail open, the request will not be checked by the icap server. If this is set to fail closed, the request will be rejected with 413 status code. Enum options - ICAP_FAIL_OPEN, ICAP_FAIL_CLOSED. Field introduced in 20.1.1."
        },
        "CloudRef": {
            "type": "string",
            "description": "The cloud where this object belongs to. This must match the cloud referenced in the pool group below. It is a reference to an object of type cloud. Field introduced in 20.1.1."
        },
        "Description": {
            "type": "string",
            "description": "A description for this icap profile. Field introduced in 20.1.1."
        },
        "EnablePreview": {
            "type": "boolean",
            "description": "Use the icap preview feature as described in rfc 3507 section 4.5. Field introduced in 20.1.1."
        },
        "FailAction": {
            "type": "string",
            "description": "Decide what should happen if there is a problem with the icap server like communication timeout, protocol error, pool error, etc. If this is set to fail open, the request will continue, but will create a significant log entry. If this is set to fail closed, the request will be rejected with a 500 status code. Enum options - ICAP_FAIL_OPEN, ICAP_FAIL_CLOSED. Field introduced in 20.1.1."
        },
        "Id": {
            "type": "string"
        },
        "Name": {
            "type": "string",
            "description": "Name of the icap profile. Field introduced in 20.1.1."
        },
        "PoolGroupRef": {
            "type": "string",
            "description": "The pool group which is used to connect to icap servers. It is a reference to an object of type poolgroup. Field introduced in 20.1.1."
        },
        "PreviewSize": {
            "type": "number",
            "description": "The icap preview size as described in rfc 3507 section 4.5. This should not exceed the size supported by the icap server. If this is set to 0, only the http header will be sent to the icap server as a preview. To disable preview completely, set the enable-preview option to false. Allowed values are 0-5000. Field introduced in 20.1.1. Unit is bytes."
        },
        "ResponseTimeout": {
            "type": "number",
            "description": "Maximum time, client's request will be paused for icap processing. If this timeout is exceeded, the request to the icap server will be aborted and the configured fail action is executed. Allowed values are 50-3600000. Field introduced in 20.1.1. Unit is milliseconds."
        },
        "ServiceUri": {
            "type": "string",
            "description": "The path and query component of the icap url. Host name and port will be taken from the pool. Field introduced in 20.1.1."
        },
        "SlowResponseWarningThreshold": {
            "type": "number",
            "description": "If the icap request takes longer than this value, this request will generate a significant log entry. Allowed values are 50-3600000. Field introduced in 20.1.1. Unit is milliseconds."
        },
        "TenantRef": {
            "type": "string",
            "description": "Tenant which this object belongs to. It is a reference to an object of type tenant. Field introduced in 20.1.1."
        },
        "Uuid": {
            "type": "string"
        },
        "Vendor": {
            "type": "string",
            "description": "The vendor of the icap server. Enum options - ICAP_VENDOR_GENERIC, ICAP_VENDOR_OPSWAT, ICAP_VENDOR_LASTLINE. Field introduced in 20.1.1."
        }
    },
    "additionalProperties": false,
    "required": [
        "Name",
        "PoolGroupRef",
        "ServiceUri"
    ],
    "readOnlyProperties": [
        "/properties/tfcfnid",
        "/properties/Id"
    ],
    "primaryIdentifier": [
        "/properties/tfcfnid"
    ],
    "handlers": {
        "create": {
            "permissions": [
                "s3:GetObject",
                "s3:DeleteObject",
                "lambda:InvokeFunction"
            ]
        },
        "read": {
            "permissions": [
                "s3:GetObject"
            ]
        },
        "update": {
            "permissions": [
                "s3:GetObject",
                "s3:DeleteObject",
                "lambda:InvokeFunction"
            ]
        },
        "delete": {
            "permissions": [
                "s3:GetObject",
                "s3:DeleteObject",
                "lambda:InvokeFunction"
            ]
        },
        "list": {
            "permissions": [
                "s3:GetObject",
                "s3:ListBucket"
            ]
        }
    }
}